## Pandas

In [1]:
import pandas as pd

In [2]:
list1=["akshay","rajat","shravan"]
list1

['akshay', 'rajat', 'shravan']

In [5]:
ser1=pd.Series(list1) # to create series
ser1

0     akshay
1      rajat
2    shravan
dtype: object

In [6]:
type(ser1)

pandas.core.series.Series

In [7]:
list2=["id1","id2","id3"]

In [8]:
ser1=pd.Series(list1,list2) #parameter 1= value  parameter 2= key or index

In [9]:
ser1

id1     akshay
id2      rajat
id3    shravan
dtype: object

In [10]:
ser_mul=ser1*2 #series multiplication
ser_mul

id1      akshayakshay
id2        rajatrajat
id3    shravanshravan
dtype: object

In [11]:
#adding series values based on matching index(advantage of series)

stud1=pd.Series([100,99],['maths','science'])
stud2=pd.Series([99,100],['science','maths'])
stud1+stud2

maths      200
science    198
dtype: int64

In [12]:
stud1=pd.Series([100,99],['maths','science'])
stud2=pd.Series([99,100],['science','English'])
stud1+stud2

English      NaN
maths        NaN
science    198.0
dtype: float64

## DataFrame

In [13]:
emp_dt={"empName":["Ram","shyam","faran"],"salary":[11,12,13]}

In [14]:
type(emp_dt)

dict

In [16]:
df=pd.DataFrame(emp_dt)
df

  empName  salary
0     Ram      11
1   shyam      12
2   faran      13

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.shape

(3, 2)

## slicing

In [19]:
df.head(2) #top 2 values

  empName  salary
0     Ram      11
1   shyam      12

In [20]:
df.tail(2) #bottom 2 values

  empName  salary
1   shyam      12
2   faran      13

In [23]:
df.loc[1:2] #slicing between range

  empName  salary
1   shyam      12
2   faran      13

In [25]:
# accessing the values

df['empName']

0      Ram
1    shyam
2    faran
Name: empName, dtype: object

In [26]:
df.empName

0      Ram
1    shyam
2    faran
Name: empName, dtype: object

In [27]:
df.empName.values #extract values

array(['Ram', 'shyam', 'faran'], dtype=object)

In [29]:
df.empName.index #extract indices

RangeIndex(start=0, stop=3, step=1)

In [34]:
#merging  only common values
emp_df1=pd.DataFrame({'empname':['sam','ram','sham'],'salaries':[21000,25000,3000]})
emp_df2=pd.DataFrame({'empname':['sam','ram','sham'],'salaries':[23000,25000,3000]})                     
merg=pd.merge(emp_df1,emp_df2)
merg

  empname  salaries
0     ram     25000
1    sham      3000

In [38]:
on specifies merging condition
merg=pd.merge(emp_df1,emp_df2,on="empname")
merg

  empname  salaries_x  salaries_y
0     sam       21000       23000
1     ram       25000       25000
2    sham        3000        3000

In [43]:
#joining based on primary key
df1=pd.DataFrame({"emp":["sam","ram","sham","vineeth"],"salaries":[2000,2300,4000,5000]},index=[1,2,3,4])
df2=pd.DataFrame({"leaves":[10,20,30,35]},index=[1,2,3,5])
jn=df1.join(df2)
jn

       emp  salaries  leaves
1      sam      2000    10.0
2      ram      2300    20.0
3     sham      4000    30.0
4  vineeth      5000     NaN

In [58]:
df4=pd.DataFrame({"emp":["sam","ram","sham","vineeth"],"salaries":[2000,2300,4000,5000]})
df4

       emp  salaries
0      sam      2000
1      ram      2300
2     sham      4000
3  vineeth      5000

In [59]:
df4.set_index("emp",inplace=True)
print(df4)

         salaries
emp
sam          2000
ram          2300
sham         4000
vineeth      5000

In [63]:
df5=pd.DataFrame({"emp":["sam","ram","sham","vineeth"],"salaries":[2000,2300,4000,5000]})
df6=pd.DataFrame({"emp":["sam","ram","sham","vineeth"],"salaries":[2000,2300,4000,5000]})
conc=pd.concat((df5,df6))
conc

       emp  salaries
0      sam      2000
1      ram      2300
2     sham      4000
3  vineeth      5000
0      sam      2000
1      ram      2300
2     sham      4000
3  vineeth      5000